def quick_sort(arr: list) -> list:
    """
    Сортує список за допомогою алгоритму швидкого сортування (Quick Sort).

    Алгоритм вибирає опорний елемент, розділяє список на дві частини:
    елементи менші за опорний та елементи більші за опорний, і рекурсивно
    застосовує ту ж саму процедуру до кожної з частин.

    Аргументи:
        arr (list): Вхідний список, який необхідно відсортувати.

    Повертає:
        list: Відсортований список.
    """
    if len(arr) <= 1:
        return arr
    # обираємо середину масиву як опорний елемент
    pivot = arr[len(arr) // 2]
    # розділяємо список на три частини: елементи менші, рівні та більші за опорний
    left = [x for x in arr if x < pivot]  # елементи менші за опорний
    middle = [x for x in arr if x == pivot]  # елементи рівні опорному
    right = [x for x in arr if x > pivot]  # елементи більші за опорний

    # рекурсивно застосовуємо швидке сортування до 'left' і 'right',
    # а потім з'єднуємо відсортовані частини разом з 'middle'
    return quick_sort(left) + middle + quick_sort(right)


if __name__ == "__main__":
    numbers = [5, 3, 8, 4, 2]
    print(numbers, quick_sort(numbers))
    # Виведе: [2, 3, 4, 5, 8]
